/* ContentView.swift */
"Work Time" = "工作时间";
"Rest Time" = "休息时间";
"Long Rest Time" = "长休息时间";
"Today: %d 🍅" = "今天：%d 🍅";
"This Week: %d 🍅" = "本周：%d 🍅";
"Total: %d 🍅" = "总计：%d 🍅";
"Date" = "日期";
"Count" = "数量";
"Work Round Count" = "工作轮数";
"Show Chart" = "显示图表";
"Reset" = "重置";
"Quit" = "退出";
"Switch Current Phase" = "切换当前阶段";
"Open Settings" = "打开设置";
"Show past 7 days progress chart" = "显示过去 7 天的进度图表";
"Quit Pomodoro Timer Lite" = "退出番茄计时器 Lite";

/* SettingsView.swift */
"Start automatically when computer starts" = "开机时自动启动";
"⏱ Auto Start Control" = "⏱ 自动启动控制";
"🔔 Sound" = "🔔 声音";
"Enable Sound" = "启用声音";
"Notification Sound" = "通知声音";
"Ping" = "Ping";
"Glass" = "Glass";
"Hero" = "Hero";
"Tink" = "Tink";
"Purr" = "Purr";
"Basso" = "Basso";
"Blow" = "Blow";
"Bottle" = "Bottle";
"Frog" = "Frog";
"Funk" = "Funk";
"Pop" = "Pop";
"Sosumi" = "Sosumi";
"⏲ Duration (Minutes)" = "⏲ 时长（分钟）";
"Auto Start Work on First Launch Each Day" = "每天首次启动时自动开始工作";
"Auto Start Rest After Work" = "工作后自动开始休息";
"Auto Start Work After Rest" = "休息后自动开始工作";
"Enable Long Rest" = "启用长休息";
"Work Duration: %d" = "工作时长：%d";
"Short Rest Duration: %d" = "短休息时长：%d";
"Long Rest Duration: %d" = "长休息时长：%d";
"Long Rest After %d Rounds" = "%d 轮后长休息";
"Settings" = "设置";
"⌨️ Keyboard Shortcuts" = "⌨️ 键盘快捷键";
"Show Window" = "显示窗口";
"Start/Pause" = "开始/暂停";
"Switch Mode" = "切换模式";
"💡 Tip: If you don't see the tomato icon in the menu bar, use ⌘⇧T to show the window and locate the icon. To reposition: hold ⌘ and drag less-used icons to the left (hidden area) to make room for frequently-used apps." = "💡 提示：如果在菜单栏没有看到番茄图标，可以用 ⌘ ⇧ T 呼出窗口来定位图标位置。调整位置：按住 ⌘ 将不常用图标拖到左侧（隐藏区域），为常用应用腾出空间。";

/* StatusBarController.swift */
"Quit Pomodoro Timer Lite" = "退出番茄计时器 Lite";

/* PomodoroTimer.swift - Notifications */
"🍅 Pomodoro Session Ended" = "🍅 番茄钟结束";
"Rest is over. Time to focus!" = "休息结束，开始专注！";
"Work completed. Take a break!" = "工作完成，休息一下吧！";

/* Statistics Export */
"📊 Statistics Export" = "📊 统计数据导出";
"Export to CSV" = "导出为 CSV";
"Weekly Report (PDF)" = "每周报告（PDF）";
"Monthly Report (PDF)" = "每月报告（PDF）";
"All-Time Report (PDF)" = "总体报告（PDF）";

/* StatisticsExporter.swift - CSV Export */
"Export Statistics to CSV" = "导出统计数据为 CSV";
"Cumulative Total" = "累计总数";

/* StatisticsExporter.swift - PDF Export */
"Export %@ Report" = "导出%@报告";
"Export Successful" = "导出成功";
"Export Failed" = "导出失败";
"Report exported to %@" = "报告已导出至 %@";

/* PDF Report Content */
"Weekly" = "每周";
"Monthly" = "每月";
"All-Time" = "总体";
"Generated: %@" = "生成日期：%@";
"Summary" = "摘要";
"Total sessions in period: %d" = "周期内总番茄钟：%d";
"Number of days: %d" = "天数：%d";
"Average sessions per day: %.1f" = "平均每天番茄钟数：%.1f";
"Most productive day: %@ (%d sessions)" = "效率最高的一天：%@（%d 个番茄钟）";
"sessions" = "个番茄钟";
"All-time total sessions: %d" = "历史总番茄钟：%d";
"Activity Chart" = "活动图表";
"Weekly Overview" = "每周概览";
"Daily Breakdown" = "每日明细";
"Sessions" = "番茄钟数";

/* Achievements */
"🏆 Achievements" = "🏆 成就";
"Unlocked: %d/%d" = "已解锁：%d/%d";
"View All" = "查看全部";
"View Achievements" = "查看成就";
"Achievements" = "成就";
"achievements.title" = "成就";
"achievements.current_streak" = "%d 天连续";
"Today: %d" = "今天：%d";
"Week: %d" = "本周：%d";
"Total: %d" = "总计：%d";
"%d days" = "%d 天";

/* Achievements Window Tabs */
"Badges" = "勋章";
"Statistics" = "统计";
"Last 7 Days" = "最近 7 天";
"Last 30 Days" = "最近 30 天";
"Last 52 Weeks" = "最近 52 周";
"All Time" = "全部历史";
"Current Streak" = "当前连续";
"Total Days" = "总天数";
"Total Sessions" = "总番茄钟数";
"Average per Day" = "日均数量";
"Average per Week" = "周均数量";
"Daily Sessions" = "每日番茄钟";
"Weekly Sessions" = "每周番茄钟";
"Week" = "周";
"This week: %d" = "本周：%d";

/* Achievement Titles */
"achievement.first_session.title" = "初次专注";
"achievement.first_session.desc" = "完成第一个番茄钟";
"achievement.sessions_10.title" = "初露锋芒";
"achievement.sessions_10.desc" = "完成 10 个番茄钟";
"achievement.sessions_50.title" = "持之以恒";
"achievement.sessions_50.desc" = "完成 50 个番茄钟";
"achievement.sessions_100.title" = "百里挑一";
"achievement.sessions_100.desc" = "完成 100 个番茄钟";
"achievement.sessions_500.title" = "专注大师";
"achievement.sessions_500.desc" = "完成 500 个番茄钟";
"achievement.sessions_1000.title" = "传奇之路";
"achievement.sessions_1000.desc" = "完成 1000 个番茄钟";
"achievement.streak_7.title" = "一周勇士";
"achievement.streak_7.desc" = "连续使用应用 7 天";
"achievement.streak_30.title" = "月度大师";
"achievement.streak_30.desc" = "连续使用应用 30 天";
"achievement.streak_100.title" = "坚持冠军";
"achievement.streak_100.desc" = "连续使用应用 100 天";

/* About Window */
"app.name" = "番茄计时器 Lite";
"About Pomodoro Timer Lite" = "关于番茄计时器 Lite";
"Version %@ (Build %@)" = "版本 %@（构建 %@）";
"A simple and elegant Pomodoro timer for macOS. Stay focused, boost productivity, and manage your time effectively with the Pomodoro Technique." = "一款简洁优雅的 macOS 番茄计时器。运用番茄工作法保持专注、提升效率、有效管理时间。";
"Developer:" = "开发者：";
"Copyright:" = "版权：";
"System Requirements:" = "系统要求：";
"View on App Store" = "在 App Store 查看";
"Rate on App Store" = "在 App Store 评分";
"Open Source on GitHub" = "在 GitHub 开源";
"Licensed under MIT License" = "基于 MIT 许可证";

/* Achievement Notifications */
"🏆 Achievement Unlocked!" = "🏆 成就解锁！";
"You've earned the \"%@\" badge!" = "你获得了「%@」徽章！";
"🎉 Congratulations on unlocking new achievements!" = "🎉 恭喜解锁新成就！";
"Dismiss" = "关闭";

/* Chart Tooltip */
"session" = "个番茄钟";
"sessions" = "个番茄钟";
